[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:19:23
 export default function RecommendationRequestTable({
   requests,
   currentUser,
-  onPendingRequests = false,
+  onPendingRequests = true,
 }) {
   const navigate = useNavigate();
killedBy: CompletedRequestsPage tests Renders completed and denied requests for professor
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="status-span-6"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:23:34
 }) {
   const navigate = useNavigate();
   const queryClient = useQueryClient();
-  const editCallback = (cell) => {
-    navigate(`/requests/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/requests/edit/2"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:48:5
   };
 
   const updateStatusMutation = useBackendMutation(
-    (params) => cellToAxiosParamsUpdateStatus(params.cell, params.newStatus),
+    () => undefined,
     {
       onSuccess: (message) => {
killedBy: PendingRequestsPage tests Dropdown menu appears for professor user on pending requests page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RecommendationRequestTable-cell-row-0-col-status" role="cell"><div class="dropdown" data-testid="status-dropdown-8"><button aria-expanded="false" class="dropdown-toggle btn btn-primary" type="button">PENDING</button></div></td> instead

Ignored nodes: comments, script, style
<html>
  <h

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:49:5
 
   const updateStatusMutation = useBackendMutation(
     (params) => cellToAxiosParamsUpdateStatus(params.cell, params.newStatus),
-    {
-      onSuccess: (message) => {
-        onUpdateStatusSuccess(message);
-        // Refreshes the page immediately when status is changed by requiring a new GET call
-        queryClient.invalidateQueries(apiEndpoint);
-      },
-    },
+    {},
   );
 
killedBy: PendingRequestsPage tests Dropdown menu appears for professor user on pending requests page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RecommendationRequestTable-cell-row-0-col-status" role="cell"><div class="dropdown" data-testid="status-dropdown-8"><button aria-expanded="false" class="dropdown-toggle btn btn-primary" type="button">PENDING</button></div></td> instead

Ignored nodes: comments, script, style
<html>
  <h

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:50:31
   const updateStatusMutation = useBackendMutation(
     (params) => cellToAxiosParamsUpdateStatus(params.cell, params.newStatus),
     {
-      onSuccess: (message) => {
-        onUpdateStatusSuccess(message);
-        // Refreshes the page immediately when status is changed by requiring a new GET call
-        queryClient.invalidateQueries(apiEndpoint);
-      },
+      onSuccess: (message) => {},
     },
   );
killedBy: PendingRequestsPage tests Dropdown menu appears for professor user on pending requests page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RecommendationRequestTable-cell-row-0-col-status" role="cell"><div class="dropdown" data-testid="status-dropdown-8"><button aria-expanded="false" class="dropdown-toggle btn btn-primary" type="button">PENDING</button></div></td> instead

Ignored nodes: comments, script, style
<html>
  <h

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:61:39
   const StatusCell = ({ cell }) => {
     const [status, setStatus] = React.useState(cell.row.values.status);
 
-    const handleClick = (eventKey) => {
-      setStatus(eventKey);
-      updateStatusMutation.mutate({ cell, newStatus: eventKey });
-    };
+    const handleClick = (eventKey) => {};
 
     if (onPendingRequests && hasRole(currentUser, "ROLE_PROFESSOR")) {
killedBy: PendingRequestsPage tests Dropdown menu appears for professor user on pending requests page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RecommendationRequestTable-cell-row-0-col-status" role="cell"><div class="dropdown" data-testid="status-dropdown-8"><button aria-expanded="false" class="dropdown-toggle btn btn-primary" type="button">PENDING</button></div></td> instead

Ignored nodes: comments, script, style
<html>
  <h

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:63:35
 
     const handleClick = (eventKey) => {
       setStatus(eventKey);
-      updateStatusMutation.mutate({ cell, newStatus: eventKey });
+      updateStatusMutation.mutate({});
     };
 
killedBy: PendingRequestsPage tests Dropdown menu appears for professor user on pending requests page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RecommendationRequestTable-cell-row-0-col-status" role="cell"><div class="dropdown" data-testid="status-dropdown-8"><button aria-expanded="false" class="dropdown-toggle btn btn-primary" type="button">PENDING</button></div></td> instead

Ignored nodes: comments, script, style
<html>
  <h

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:66:9
       updateStatusMutation.mutate({ cell, newStatus: eventKey });
     };
 
-    if (onPendingRequests && hasRole(currentUser, "ROLE_PROFESSOR")) {
+    if (false) {
       return (
         <DropdownButton
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="status-dropdown-8"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:66:70
       updateStatusMutation.mutate({ cell, newStatus: eventKey });
     };
 
-    if (onPendingRequests && hasRole(currentUser, "ROLE_PROFESSOR")) {
-      return (
-        <DropdownButton
-          title={status}
-          data-testid={`status-dropdown-${cell.row.values.id}`}
-          onSelect={handleClick}
-        >
-          <Dropdown.Item eventKey="PENDING">PENDING</Dropdown.Item>
-          <Dropdown.Item eventKey="COMPLETED">COMPLETED</Dropdown.Item>
-          <Dropdown.Item eventKey="DENIED">DENIED</Dropdown.Item>
-        </DropdownButton>
-      );
-    } else {
+    if (onPendingRequests && hasRole(currentUser, "ROLE_PROFESSOR")) {} else {
       return (
         <span data-testid={`status-span-${cell.row.values.id}`}>
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:78:12
           <Dropdown.Item eventKey="DENIED">DENIED</Dropdown.Item>
         </DropdownButton>
       );
-    } else {
-      return (
-        <span data-testid={`status-span-${cell.row.values.id}`}>
-          {cell.row.values.status}
-        </span>
-      );
-    }
+    } else {}
   };
 
killedBy: PendingRequestsPage tests Renders pending requests for student
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:121:5
       accessor: "status",
       Cell: StatusCell,
     },
-    {
-      Header: "Submission Date",
-      accessor: "submissionDate",
-    },
+    {},
     {
       Header: "Last Modified Date",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:133:5
       Header: "Completion Date",
       accessor: "completionDate",
     },
-    {
-      Header: "Due Date",
-      accessor: "dueDate",
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:134:15
       accessor: "completionDate",
     },
     {
-      Header: "Due Date",
+      Header: "",
       accessor: "dueDate",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Due Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:140:42
   ];
 
   //since all admins have the role of a user, we can just check if the current user has the role ROLE_USER
-  if (hasRole(currentUser, "ROLE_USER")) {
-    columns.push(
-      ButtonColumn(
-        "Delete",
-        "danger",
-        deleteCallback,
-        "RecommendationRequestTable",
-      ),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_USER")) {}
 
   if (
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestTable.js:152:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN")
+    hasRole(currentUser, "ROLE_USER") || !hasRole(currentUser, "ROLE_ADMIN")
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:152:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN")
+    false
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:153:5
 
   if (
     hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN")
+    hasRole(currentUser, "ROLE_ADMIN")
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:154:5
   if (
     hasRole(currentUser, "ROLE_USER") &&
     !hasRole(currentUser, "ROLE_ADMIN")
-  ) {
-    columns.push(
-      ButtonColumn(
-        "Edit",
-        "primary",
-        editCallback,
-        "RecommendationRequestTable",
-      ),
-    );
-  }
+  ) {}
 
   return (
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
