[Killed] StringLiteral
main/components/Nav/AppNavbar.js:13:40
   currentUrl = window.location.href,
 }) {
   const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
-  const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
+  const isAdmin = hasRole(currentUser, "");
   const isProfessor = hasRole(currentUser, "ROLE_PROFESSOR");
   const isStudent = hasRole(currentUser, "ROLE_STUDENT");
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] StringLiteral
main/components/Nav/AppNavbar.js:14:44
 }) {
   const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
   const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
-  const isProfessor = hasRole(currentUser, "ROLE_PROFESSOR");
+  const isProfessor = hasRole(currentUser, "");
   const isStudent = hasRole(currentUser, "ROLE_STUDENT");
   const isLoggedIn = currentUser && currentUser.loggedIn;
killedBy: AppNavbar tests renders the three prof pages correctly for professor users
statusReason: Error: Unable to find an element with the text: Pending Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:16:22
   const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
   const isProfessor = hasRole(currentUser, "ROLE_PROFESSOR");
   const isStudent = hasRole(currentUser, "ROLE_STUDENT");
-  const isLoggedIn = currentUser && currentUser.loggedIn;
+  const isLoggedIn = currentUser || currentUser.loggedIn;
 
   return (
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:16:22
   const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
   const isProfessor = hasRole(currentUser, "ROLE_PROFESSOR");
   const isStudent = hasRole(currentUser, "ROLE_STUDENT");
-  const isLoggedIn = currentUser && currentUser.loggedIn;
+  const isLoggedIn = true;
 
   return (
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:42:14
             {systemInfo?.springH2ConsoleEnabled && (
               <Nav.Link href="/h2-console">H2Console</Nav.Link>
             )}
-            {systemInfo?.showSwaggerUILink && (
-              <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
-            )}
+            {systemInfo?.showSwaggerUILink || <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>}
           </Nav>
 
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNa

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:49:17
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {(isAdmin || isProfessor) && (
+              {(true) && (
                 <NavDropdown
                   title="Admin"
killedBy: AppNavbar tests Admin dropdown does NOT render for normal user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="nav-item dropdown" data-testid="appnavbar-admin-dropdown"><a aria-expanded="false" class="dropdown-toggle nav-link" href="#" id="appnavbar-admin-dropdown" role="button" tabindex="0">Admin</a></div> instead

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:49:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {(isAdmin || isProfessor) && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  {isAdmin && (
-                    <NavDropdown.Item href="/admin/users">
-                      Users
-                    </NavDropdown.Item>
-                  )}
-                  <NavDropdown.Item as={Link} to="/settings/requesttypes">
-                    Request Types
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
 
               {(isProfessor || isStudent) && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:55:20
                   id="appnavbar-admin-dropdown"
                   data-testid="appnavbar-admin-dropdown"
                 >
-                  {isAdmin && (
-                    <NavDropdown.Item href="/admin/users">
-                      Users
-                    </NavDropdown.Item>
-                  )}
+                  {isAdmin || <NavDropdown.Item href="/admin/users">
+                      Users
+                    </NavDropdown.Item>}
                   <NavDropdown.Item as={Link} to="/settings/requesttypes">
                     Request Types
killedBy: AppNavbar tests 'Users' link is visible only for ROLE_ADMIN
statusReason: Error: Unable to find an element with the text: Users. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:55:20
                   id="appnavbar-admin-dropdown"
                   data-testid="appnavbar-admin-dropdown"
                 >
-                  {isAdmin && (
-                    <NavDropdown.Item href="/admin/users">
-                      Users
-                    </NavDropdown.Item>
-                  )}
+                  {false}
                   <NavDropdown.Item as={Link} to="/settings/requesttypes">
                     Request Types
killedBy: AppNavbar tests 'Users' link is visible only for ROLE_ADMIN
statusReason: Error: Unable to find an element with the text: Users. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:66:16
                 </NavDropdown>
               )}
 
-              {(isProfessor || isStudent) && (
-                <>
-                  <Nav.Link as={Link} to="/requests/pending">
-                    Pending Requests
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/requests/completed">
-                    Completed Requests
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/requests/statistics">
-                    Statistics
-                  </Nav.Link>
-                </>
-              )}
+              {true}
             </Nav>
 
killedBy: AppNavbar tests renders the three prof pages correctly for professor users
statusReason: Error: Unable to find an element with the text: Pending Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:66:16
                 </NavDropdown>
               )}
 
-              {(isProfessor || isStudent) && (
-                <>
-                  <Nav.Link as={Link} to="/requests/pending">
-                    Pending Requests
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/requests/completed">
-                    Completed Requests
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/requests/statistics">
-                    Statistics
-                  </Nav.Link>
-                </>
-              )}
+              {isProfessor || isStudent || <>
+                  <Nav.Link as={Link} to="/requests/pending">
+                    Pending Requests
+                  </Nav.Link>
+                  <Nav.Link as={Link} to="/requests/completed">
+                    Completed Requests
+                  </Nav.Link>
+                  <Nav.Link as={Link} to="/requests/statistics">
+                    Statistics
+                  </Nav.Link>
+                </>}
             </Nav>
 
killedBy: PendingRequestsPage tests Renders expected content
statusReason: Error: Found multiple elements with the text: Pending Requests

Here are the matching elements:

Ignored nodes: comments, script, style
<a
  class="nav-link"
  href="/requests/pending"
