[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:13:22
   currentUrl = window.location.href,
 }) {
   // ---------- role helpers ----------
-  const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  const oauthLogin = systemInfo?.oauthLogin && "/oauth2/authorization/google";
   const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
   const isProfessor = hasRole(currentUser, "ROLE_PROFESSOR");
killedBy: AppNavbar tests when oauthLogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] OptionalChaining
main/components/Nav/AppNavbar.js:13:22
   currentUrl = window.location.href,
 }) {
   // ---------- role helpers ----------
-  const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  const oauthLogin = systemInfo.oauthLogin || "/oauth2/authorization/google";
   const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
   const isProfessor = hasRole(currentUser, "ROLE_PROFESSOR");
killedBy: AppNavbar tests 'Users' link visible only for ROLE_ADMIN
statusReason: TypeError: Cannot read properties of undefined (reading 'oauthLogin')

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:16:22
   const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
   const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
   const isProfessor = hasRole(currentUser, "ROLE_PROFESSOR");
-  const isLoggedIn = currentUser && currentUser.loggedIn;
+  const isLoggedIn = currentUser || currentUser.loggedIn;
 
   return (
killedBy: AppNavbar tests when oauthLogin undefined, default value is used
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:16:22
   const oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
   const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
   const isProfessor = hasRole(currentUser, "ROLE_PROFESSOR");
-  const isLoggedIn = currentUser && currentUser.loggedIn;
+  const isLoggedIn = true;
 
   return (
killedBy: AppNavbar tests when oauthLogin undefined, default value is used
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:21:8
   return (
     <>
       {/* ---- dev-only banner ---- */}
-      {(currentUrl.startsWith("http://localhost:3000") ||
-        currentUrl.startsWith("http://127.0.0.1:3000")) && (
-        <AppNavbarLocalhost url={currentUrl} />
-      )}
+      {true}
 
       <Navbar
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:21:9
   return (
     <>
       {/* ---- dev-only banner ---- */}
-      {(currentUrl.startsWith("http://localhost:3000") ||
-        currentUrl.startsWith("http://127.0.0.1:3000")) && (
+      {(true) && (
         <AppNavbarLocalhost url={currentUrl} />
       )}
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="/AppNavbarLocalhost/i"]

Here are the matching elements:

Ignored nodes: comments, script, style
<nav
  class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
  data-testid="AppNavbarLocalhost"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:42:14
 
           {/* ---- Left-aligned util links ---- */}
           <Nav className="me-auto">
-            {systemInfo?.springH2ConsoleEnabled && (
-              <Nav.Link href="/h2-console">H2Console</Nav.Link>
-            )}
+            {systemInfo?.springH2ConsoleEnabled || <Nav.Link href="/h2-console">H2Console</Nav.Link>}
             {systemInfo?.showSwaggerUILink && (
               <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:54:17
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
               {/* ---------- Admin dropdown ---------- */}
-              {(isAdmin || isProfessor) && (
+              {(isAdmin && isProfessor) && (
                 <NavDropdown
                   title="Admin"
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:54:17
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
               {/* ---------- Admin dropdown ---------- */}
-              {(isAdmin || isProfessor) && (
+              {(true) && (
                 <NavDropdown
                   title="Admin"
killedBy: AppNavbar tests Admin dropdown does NOT render for normal user
statusReason: Error: expect(received).toBeNull()

Received: <div class="nav-item dropdown" data-testid="appnavbar-admin-dropdown"><a aria-expanded="false" class="dropdown-toggle nav-link" href="#" id="appnavbar-admin-dropdown" role="button" tabindex="0">Admin</a></div>

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:61:20
                   data-testid="appnavbar-admin-dropdown"
                 >
                   {/* Users ⇢ admins only */}
-                  {isAdmin && (
-                    <NavDropdown.Item
-                      as={Link}
-                      to="/admin/users"
-                      data-testid="appnavbar-users"
-                    >
-                      Users
-                    </NavDropdown.Item>
-                  )}
+                  {isAdmin || <NavDropdown.Item as={Link} to="/admin/users" data-testid="appnavbar-users">
+                      Users
+                    </NavDropdown.Item>}
 
                   <NavDropdown.Item
killedBy: AppNavbar tests 'Users' link visible only for ROLE_ADMIN
statusReason: Error: Unable to find an element with the text: Users. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:61:20
                   data-testid="appnavbar-admin-dropdown"
                 >
                   {/* Users ⇢ admins only */}
-                  {isAdmin && (
-                    <NavDropdown.Item
-                      as={Link}
-                      to="/admin/users"
-                      data-testid="appnavbar-users"
-                    >
-                      Users
-                    </NavDropdown.Item>
-                  )}
+                  {false}
 
                   <NavDropdown.Item
killedBy: AppNavbar tests 'Users' link visible only for ROLE_ADMIN
statusReason: Error: Unable to find an element with the text: Users. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:82:16
               )}
 
               {/* ---------- Settings dropdown (Request Types) ---------- */}
-              {(isAdmin || isProfessor) && (
-                <NavDropdown
-                  title="Settings"
-                  id="appnavbar-settings-dropdown"
-                  data-testid="appnavbar-settings-dropdown"
-                >
-                  <NavDropdown.Item
-                    as={Link}
-                    to="/settings/requesttypes"
-                    data-testid="appnavbar-requesttypes"
-                  >
-                    Request Types
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {isAdmin || isProfessor || <NavDropdown title="Settings" id="appnavbar-settings-dropdown" data-testid="appnavbar-settings-dropdown">
+                  <NavDropdown.Item as={Link} to="/settings/requesttypes" data-testid="appnavbar-requesttypes">
+                    Request Types
+                  </NavDropdown.Item>
+                </NavDropdown>}
 
               {/* ---------- Request-page links ---------- */}
killedBy: AppNavbar tests Settings dropdown visibility Settings dropdown and 'Request Types' link render for ROLE_ADMIN
statusReason: Error: Unable to find role="button" and name `/settings/i`

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:82:16
               )}
 
               {/* ---------- Settings dropdown (Request Types) ---------- */}
-              {(isAdmin || isProfessor) && (
-                <NavDropdown
-                  title="Settings"
-                  id="appnavbar-settings-dropdown"
-                  data-testid="appnavbar-settings-dropdown"
-                >
-                  <NavDropdown.Item
-                    as={Link}
-                    to="/settings/requesttypes"
-                    data-testid="appnavbar-requesttypes"
-                  >
-                    Request Types
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
 
               {/* ---------- Request-page links ---------- */}
killedBy: AppNavbar tests Settings dropdown visibility Settings dropdown and 'Request Types' link render for ROLE_ADMIN
statusReason: Error: Unable to find role="button" and name `/settings/i`

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:99:17
               )}
 
               {/* ---------- Request-page links ---------- */}
-              {(hasRole(currentUser, "ROLE_USER") || isProfessor) && (
+              {(true) && (
                 <>
                   <Nav.Link as={Link} to="/requests/pending">
killedBy: AppNavbar tests request links are hidden when not logged in
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="nav-link" href="/requests/pending">Pending Requests</a> instead

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:99:16
               )}
 
               {/* ---------- Request-page links ---------- */}
-              {(hasRole(currentUser, "ROLE_USER") || isProfessor) && (
-                <>
-                  <Nav.Link as={Link} to="/requests/pending">
-                    Pending Requests
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/requests/completed">
-                    Completed Requests
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/requests/statistics">
-                    Statistics
-                  </Nav.Link>
-                </>
-              )}
+              {false}
             </Nav>
 
killedBy: AppNavbar tests request links render for professor users
statusReason: TestingLibraryElementError: Unable to find an element with the text: Pending Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-test
