[Killed] MethodExpression
main/pages/Requests/PendingRequestsPage.js:29:27
     [],
   );
 
-  const pendingRequests = requests.filter(
-    (request) => request.status === "PENDING",
-  );
+  const pendingRequests = requests;
 
   return (
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] EqualityOperator
main/pages/Requests/PendingRequestsPage.js:30:18
   );
 
   const pendingRequests = requests.filter(
-    (request) => request.status === "PENDING",
+    (request) => request.status !== "PENDING",
   );
 
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
main/pages/Requests/PendingRequestsPage.js:30:18
   );
 
   const pendingRequests = requests.filter(
-    (request) => request.status === "PENDING",
+    (request) => true,
   );
 
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BooleanLiteral
main/pages/Requests/PendingRequestsPage.js:41:32
           <RecommendationRequestTable
             requests={pendingRequests}
             currentUser={currentUser}
-            onPendingRequests={true}
+            onPendingRequests={false}
           />
         </div>
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="status-dropdown-8"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
