[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:23:64
   toast(message);
 }
 
-export function cellToAxiosParamsUpdateStatus(cell, newStatus) {
-  return {
-    url: "/api/recommendationrequest/professor",
-    method: "PUT",
-    params: { id: cell.row.values.id },
-    data: { status: newStatus },
-  };
-}
+export function cellToAxiosParamsUpdateStatus(cell, newStatus) {}
 
killedBy: RecommendationRequestUtils cellToAxiosParamsUpdateStatus It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": {"status": "COMPLETED"}, "method": "PUT", "params": {"id": 17}, "url": "/api/recommendationrequest/professor"}
Received: undefined
