[Killed] ObjectLiteral
main/components/RequestType/RequestTypeForm.js:24:39
           id="requestType"
           type="text"
           isInvalid={Boolean(errors.requestType)}
-          {...register("requestType", { required: "Request type is required" })}
+          {...register("requestType", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RequestTypeForm shows validation error if empty
statusReason: Error: Unable to find an element with the text: Request type is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
