[Killed] BlockStatement
main/pages/RequestType/RequestTypesCreatePage.js:5:50
 
 import React from "react";
 
-export default function RequestTypesCreatePage() {
-  return (
-    <div data-testid="RequestTypesCreatePage">
-      <h1>Request Types Create Page (Placeholder)</h1>
-    </div>
-  );
-}
+export default function RequestTypesCreatePage() {}
 
killedBy: RequestTypesCreatePage renders placeholder heading
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypesCreatePage"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
