[Killed] BlockStatement
main/pages/RequestType/RequestTypesEditPage.js:6:48
 import React from "react";
 import { useParams } from "react-router-dom";
 
-export default function RequestTypesEditPage() {
-  const { id } = useParams();
-
-  return (
-    <div data-testid="RequestTypesEditPage">
-      <h1>Request Types Edit Page for id={id} (Placeholder)</h1>
-    </div>
-  );
-}
+export default function RequestTypesEditPage() {}
 
killedBy: RequestTypesEditPage renders placeholder with ID
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypesEditPage"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
