[Killed] BlockStatement
main/pages/RequestType/RequestTypesIndexPage.js:5:49
 
 import React from "react";
 
-export default function RequestTypesIndexPage() {
-  return (
-    <div data-testid="RequestTypesIndexPage">
-      <h1>Request Types Index Page (Placeholder)</h1>
-    </div>
-  );
-}
+export default function RequestTypesIndexPage() {}
 
killedBy: RequestTypesIndexPage renders placeholder heading
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypesIndexPage"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
