[Killed] BooleanLiteral
src/main/utils/RecommendationRequestUtils.js:14:57
  * @param {object} cell     – table-cell object
  * @param {boolean} isAdmin – if true, hits the admin endpoint
  */
-export function cellToAxiosParamsDelete(cell, isAdmin = false) {
+export function cellToAxiosParamsDelete(cell, isAdmin = true) {
   return {
     url: isAdmin
killedBy: RecommendationRequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {

[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:14:64
  * @param {object} cell     – table-cell object
  * @param {boolean} isAdmin – if true, hits the admin endpoint
  */
-export function cellToAxiosParamsDelete(cell, isAdmin = false) {
-  return {
-    url: isAdmin
-      ? "/api/recommendationrequest/admin"
-      : "/api/recommendationrequest",
-    method: "DELETE",
-    params: { id: cell.row.values.id },
-  };
-}
+export function cellToAxiosParamsDelete(cell, isAdmin = false) {}
 
 export function onUpdateStatusSuccess(message) {
killedBy: UserTable tests Delete button calls delete callback (for user)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/RecommendationRequestUtils.js:17:9
 export function cellToAxiosParamsDelete(cell, isAdmin = false) {
   return {
     url: isAdmin
-      ? "/api/recommendationrequest/admin"
+      ? ""
       : "/api/recommendationrequest",
     method: "DELETE",
killedBy: RecommendationRequestUtils cellToAxiosParamsDeleteAdmin It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {
