[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:27:19
   );
 
   //queries endpoint to get list of professors
-  useEffect(() => {
-    const getProfessors = async () => {
-      try {
-        const response = await fetch("/api/admin/users/professors");
-        const data = await response.json();
-        setProfessors(data);
-      } catch (error) {
-        console.error("Error fetching professors");
-      }
-    };
-    const getRequestTypes = async () => {
-      try {
-        const response = await fetch("/api/requesttypes/all");
-        const data = await response.json();
-        setRecommendationTypes(data);
-      } catch (error) {
-        console.error("Error fetching request types");
-      }
-    };
-
-    getProfessors();
-    getRequestTypes();
-  }, []); // Add empty dependency array to prevent infinite re-rendering
+  useEffect(() => {}, []); // Add empty dependency array to prevent infinite re-rendering
 
   const navigate = useNavigate();
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ArrayDeclaration
main/components/RecommendationRequest/RecommendationRequestForm.js:49:6
 
     getProfessors();
     getRequestTypes();
-  }, []); // Add empty dependency array to prevent infinite re-rendering
+  }, ["Stryker was here"]); // Add empty dependency array to prevent infinite re-rendering
 
   const navigate = useNavigate();

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:126:46
               id="requestType_id"
               type="string"
               isInvalid={Boolean(errors.requestType_id)}
-              {...register("requestType_id", {
-                required: "Please select a recommendation type",
-              })}
+              {...register("requestType_id", {})}
               defaultValue=""
             >
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a recommendation type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestForm.js:137:44
                   <option disabled value="">
                     Select a recommendation type
                   </option>
-                  {recommendationTypes.map((recommendationType) => (
-                    <option
-                      key={recommendationType.id}
-                      value={recommendationType.id}
-                    >
-                      {recommendationType.requestType}
-                    </option>
-                  ))}
+                  {recommendationTypes.map(() => undefined)}
                 </>
               ) : (
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: Unable to find an element with the text: CS Department BS/MS program. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:153:14
               )}
               <option value="OTHER">Other</option>
             </Form.Select>
-            {errors.requestType_id && (
-              <Form.Control.Feedback type="invalid">
-                {errors.requestType_id.message}
-              </Form.Control.Feedback>
-            )}
+            {errors.requestType_id || <Form.Control.Feedback type="invalid">
+                {errors.requestType_id.message}
+              </Form.Control.Feedback>}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:153:14
               )}
               <option value="OTHER">Other</option>
             </Form.Select>
-            {errors.requestType_id && (
-              <Form.Control.Feedback type="invalid">
-                {errors.requestType_id.message}
-              </Form.Control.Feedback>
-            )}
+            {true}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a recommendation type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
