[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:108:5
       Header: "Requester Email",
       accessor: "requester.email",
     },
-    {
-      Header: "Recommendation Type",
-      accessor: "requestType.requestType",
-    },
+    {},
     {
       Header: "Details",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!
