[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:36:23
         const data = await response.json();
         setProfessors(data);
       } catch (error) {
-        console.error("Error fetching professors:", error.message);
+        console.error("", error.message);
       }
     };
killedBy: RecommendationRequestForm tests that the correct error messages appear in console when fetch calls fail in component
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching professors:", "Simulated: Professors fetch failed"
Received
       1: "", "Simulated: Professors fetch failed"
       2: "Error fetching request types:", "Simulated: Request types fetch failed"

Number of calls: 2

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:93:45
               defaultValue=""
             >
               {/* Stryker disable next-line all: Conditional logic for dropdown population */}
-              {Array.isArray(professors) && professors.length > 0 ? (
+              {Array.isArray(professors) && professors.length <= 0 ? (
                 <>
                   <option disabled value="">
killedBy: RecommendationRequestForm tests renders correctly with no initialContents and dropdowns populate from mock fetch
statusReason: Error: Unable to find role="option" and name "Craig Zzyxx"

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:93:45
               defaultValue=""
             >
               {/* Stryker disable next-line all: Conditional logic for dropdown population */}
-              {Array.isArray(professors) && professors.length > 0 ? (
+              {Array.isArray(professors) && professors.length >= 0 ? (
                 <>
                   <option disabled value="">
killedBy: RecommendationRequestForm tests that dropdown renders correctly with empty arrays
statusReason: Error: Unable to find an element with the text: No professors available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:136:16
               defaultValue=""
             >
               {/* Stryker disable next-line all: Conditional logic for dropdown population */}
-              {Array.isArray(recommendationTypes) &&
-              recommendationTypes.length > 0 ? (
+              {Array.isArray(recommendationTypes) || recommendationTypes.length > 0 ? (
                 <>
                   <option disabled value="">
killedBy: RecommendationRequestForm tests that dropdown renders correctly with empty arrays
statusReason: TestingLibraryElementError: Unable to find an element with the text: No recommendation types available, use Other in details. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
