[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:18:7
 
 // Helper function to format dates as MM:DD:YYYY HH:SS (Hours:Seconds as per requirement)
 const formatDate = (dateString) => {
-  if (!dateString) return "";
+  if (dateString) return "";
 
   try {
killedBy: RecommendationRequestTable tests date formatting formats dates correctly to MM:DD:YYYY HH:SS
statusReason: TestingLibraryElementError: Unable to find an element with the text: 01:15:2023 02:05. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArithmeticOperator
main/components/RecommendationRequest/RecommendationRequestTable.js:25:26
     if (isNaN(date.getTime())) return "";
 
     // Use local time zone (getMonth, getDate, etc.) - this matches test environment
-    const month = String(date.getMonth() + 1).padStart(2, "0");
+    const month = String(date.getMonth() - 1).padStart(2, "0");
     // Stryker disable next-line StringLiteral: Zero padding required for date formatting
     const day = String(date.getDate()).padStart(2, "0");
killedBy: RecommendationRequestTable tests date formatting formats dates correctly to MM:DD:YYYY HH:SS
statusReason: TestingLibraryElementError: Unable to find an element with the text: 01:15:2023 02:05. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:29:55
     // Stryker disable next-line StringLiteral: Zero padding required for date formatting
     const day = String(date.getDate()).padStart(2, "0");
     const year = date.getFullYear();
-    const hours = String(date.getHours()).padStart(2, "0");
+    const hours = String(date.getHours()).padStart(2, "");
     const seconds = String(date.getSeconds()).padStart(2, "0");
 
killedBy: RecommendationRequestTable tests date formatting formats dates correctly to MM:DD:YYYY HH:SS
statusReason: TestingLibraryElementError: Unable to find an element with the text: 01:15:2023 02:05. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:35:12
     return `${month}:${day}:${year} ${hours}:${seconds}`;
   } catch (error) {
     // Stryker disable next-line BlockStatement: Error handling fallback
-    return "";
+    return "Stryker was here!";
   }
 };
killedBy: RecommendationRequestTable tests date formatting handles date parsing errors gracefully
statusReason: Error: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  Stryker was here!

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestTable.js:90:9
       updateStatusMutation.mutate({ cell, newStatus: eventKey });
     };
 
-    if (onPendingRequests && hasRole(currentUser, "ROLE_PROFESSOR")) {
+    if (onPendingRequests || hasRole(currentUser, "ROLE_PROFESSOR")) {
       return (
         <DropdownButton
killedBy: PendingRequestsPage tests Renders pending requests for student
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="status-span-8"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:94:24
       return (
         <DropdownButton
           title={status}
-          data-testid={`status-dropdown-${cell.row.values.id}`}
+          data-testid={``}
           onSelect={handleClick}
         >
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="status-dropdown-8"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestTable.js:189:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_USER") &&
-    // Stryker disable next-line StringLiteral: Role check is intentional
-    !hasRole(currentUser, "ROLE_ADMIN")
+    hasRole(currentUser, "ROLE_USER") ||
+// Stryker disable next-line StringLiteral: Role check is intentional
+!hasRole(currentUser, "ROLE_ADMIN")
   ) {
     columns.push(
killedBy: RecommendationRequestTable tests A user with no roles has expected content
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="/RecommendationRequestTable-cell-row-\d+-col-Edit-button/"]

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="btn btn-primary"
  data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button"

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:191:5
   if (
     hasRole(currentUser, "ROLE_USER") &&
     // Stryker disable next-line StringLiteral: Role check is intentional
-    !hasRole(currentUser, "ROLE_ADMIN")
+    hasRole(currentUser, "ROLE_ADMIN")
   ) {
     columns.push(
killedBy: RecommendationRequestTable tests Edit button navigates to the edit page for user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="/RecommendationRequestTable-cell-row-\d+-col-Edit-button/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
