[Killed] EqualityOperator
main/pages/Requests/CompletedRequestsPage.js:31:52
 
   // Stryker disable next-line all : Filter logic is intentional for completed/denied requests
   const completedRequests = requests.filter(
-    (request) => request.status === "COMPLETED" || request.status === "DENIED",
+    (request) => request.status === "COMPLETED" || request.status !== "DENIED",
   );
 
killedBy: CompletedRequestsPage tests Date formatting is applied in completed requests table (as student)
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<div
  data-testid="RecommendationRequestTable"
>
  <table
    class="table table-striped table-bordered table-hover"

[Killed] EqualityOperator
main/pages/Requests/CompletedRequestsPage.js:31:18
 
   // Stryker disable next-line all : Filter logic is intentional for completed/denied requests
   const completedRequests = requests.filter(
-    (request) => request.status === "COMPLETED" || request.status === "DENIED",
+    (request) => request.status !== "COMPLETED" || request.status === "DENIED",
   );
 
killedBy: CompletedRequestsPage tests Date formatting is applied in completed requests table (as professor)
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<div
  data-testid="RecommendationRequestTable"
>
  <table
    class="table table-striped table-bordered table-hover"
