[Killed] ArrowFunction
main/pages/Requests/PendingRequestsPage.js:30:5
   );
 
   const pendingRequests = requests.filter(
-    (request) => request.status === "PENDING",
+    () => undefined,
   );
 
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
