[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:8:56
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell, isAdmin) {
-  const urlCalled = isAdmin
-    ? "/api/recommendationrequest/admin"
-    : "/api/recommendationrequest";
-  return {
-    url: urlCalled,
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell, isAdmin) {}
 
 export function onUpdateStatusSuccess(message) {
killedBy: UserTable tests Delete button calls delete callback (for user)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/RecommendationRequestUtils.js:11:7
 export function cellToAxiosParamsDelete(cell, isAdmin) {
   const urlCalled = isAdmin
     ? "/api/recommendationrequest/admin"
-    : "/api/recommendationrequest";
+    : "";
   return {
     url: urlCalled,
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {

[Killed] StringLiteral
src/main/utils/RecommendationRequestUtils.js:14:13
     : "/api/recommendationrequest";
   return {
     url: urlCalled,
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
