[Killed] BlockStatement
main/pages/RequestType/RequestTypesCreatePage.js:4:50
 import React from "react";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RequestTypesCreatePage() {
-  return (
-    <BasicLayout>
-      <div data-testid="RequestTypesCreatePage">
-        <h1>Request Types Create Page (Placeholder)</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RequestTypesCreatePage() {}
 
killedBy: RequestTypesCreatePage renders placeholder heading
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypesCreatePage"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
