[Killed] BlockStatement
main/pages/RequestType/RequestTypesEditPage.js:5:48
 import { useParams } from "react-router-dom";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RequestTypesEditPage() {
-  const { id } = useParams();
-
-  return (
-    <BasicLayout>
-      <div data-testid="RequestTypesEditPage">
-        <h1>Request Types Edit Page for id={id} (Placeholder)</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RequestTypesEditPage() {}
 
killedBy: RequestTypesEditPage renders placeholder with ID
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypesEditPage"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
